Revit 2027 API
Document.NewSpotElevation Method
 Generate a new spot elevation object within the project.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotDimension NewSpotElevation(
	View view,
	Reference reference,
	XYZ origin,
	XYZ bend,
	XYZ end,
	XYZ refPt,
	bool hasLeader
)
Public Function NewSpotElevation (
	view As View,
	reference As Reference,
	origin As XYZ,
	bend As XYZ,
	end As XYZ,
	refPt As XYZ,
	hasLeader As Boolean
) As SpotDimension
public:
SpotDimension^ NewSpotElevation(
	View^ view,
	Reference^ reference,
	XYZ^ origin,
	XYZ^ bend,
	XYZ^ end,
	XYZ^ refPt,
	bool hasLeader
)
member NewSpotElevation :
        view : View *
        reference : Reference *
        origin : XYZ *
        bend : XYZ *
        end : XYZ *
        refPt : XYZ *
        hasLeader : bool -> SpotDimension
Parameters
view View
 The view in which the spot elevation is to be visible.
reference Reference
 The reference to which the spot elevation is to be bound.
origin XYZ
 The point which the spot elevation evaluate.
bend XYZ
 The bend point for the spot elevation.
end XYZ
 The end point for the spot elevation.
refPt XYZ
 The actual point on the reference which the spot elevation evaluate.
hasLeader Boolean
 Indicate if it has leader or not.
Return Value
SpotDimension
 If successful a new spot dimension object, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the view does not exist in the given document.
Remarks
 If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt is the projected point. If the reference is not valid or the point cannot be projected to reference correctly, an exception will be thrown
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace